#### ModuleSettings Members

---

|  |
| --- |
| ModuleSettings Class   Constructors   Methods   Properties   See Also |

The  ModuleSettings  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ModuleSettings | Constructs a new module settings. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ModuleSettings |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Description | The module description. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | MacroLanguageType | The Macro language type. |
| Public property | Name | The module name. |

# See Also

ModuleSettings Class

Autodesk.Revit.DB.Macros Namespace